zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/ecap_reg.h
#define ECAP_CTL1_CAP0CLREN_Pos         (20)                                        /*!< ECAP_T::CTL1: CAP0CLREN Position           */
#define ECAP_CTL1_CAP0CLREN_Msk         (0x1UL << ECAP_CTL1_CAP0CLREN_Pos)          /*!< ECAP_T::CTL1: CAP0CLREN Mask               */

#define ECAP_CTL1_CAP1CLREN_Pos         (21)                                        /*!< ECAP_T::CTL1: CAP1CLREN Position           */
#define ECAP_CTL1_CAP1CLREN_Msk         (0x1UL << ECAP_CTL1_CAP1CLREN_Pos)          /*!< ECAP_T::CTL1: CAP1CLREN Mask               */

#define ECAP_CTL1_CAP2CLREN_Pos         (22)                                        /*!< ECAP_T::CTL1: CAP2CLREN Position           */
#define ECAP_CTL1_CAP2CLREN_Msk         (0x1UL << ECAP_CTL1_CAP2CLREN_Pos)          /*!< ECAP_T::CTL1: CAP2CLREN Mask               */

#define ECAP_STATUS_CAPTF0_Pos          (0)                                         /*!< ECAP_T::STATUS: CAPTF0 Position            */
#define ECAP_STATUS_CAPTF0_Msk          (0x1UL << ECAP_STATUS_CAPTF0_Pos)           /*!< ECAP_T::STATUS: CAPTF0 Mask                */

#define ECAP_STATUS_CAPTF1_Pos          (1)                                         /*!< ECAP_T::STATUS: CAPTF1 Position            */
#define ECAP_STATUS_CAPTF1_Msk          (0x1UL << ECAP_STATUS_CAPTF1_Pos)           /*!< ECAP_T::STATUS: CAPTF1 Mask                */

#define ECAP_STATUS_CAPTF2_Pos          (2)                                         /*!< ECAP_T::STATUS: CAPTF2 Position            */
#define ECAP_STATUS_CAPTF2_Msk          (0x1UL << ECAP_STATUS_CAPTF2_Pos)           /*!< ECAP_T::STATUS: CAPTF2 Mask                */

#define ECAP_STATUS_CAPCMPF_Pos         (4)                                         /*!< ECAP_T::STATUS: CAPCMPF Position           */
#define ECAP_STATUS_CAPCMPF_Msk         (0x1UL << ECAP_STATUS_CAPCMPF_Pos)          /*!< ECAP_T::STATUS: CAPCMPF Mask               */

#define ECAP_STATUS_CAPOVF_Pos          (5)                                         /*!< ECAP_T::STATUS: CAPOVF Position            */
#define ECAP_STATUS_CAPOVF_Msk          (0x1UL << ECAP_STATUS_CAPOVF_Pos)           /*!< ECAP_T::STATUS: CAPOVF Mask                */

#define ECAP_STATUS_CAP0_Pos            (8)                                         /*!< ECAP_T::STATUS: CAP0 Position              */
#define ECAP_STATUS_CAP0_Msk            (0x1UL << ECAP_STATUS_CAP0_Pos)             /*!< ECAP_T::STATUS: CAP0 Mask                  */

#define ECAP_STATUS_CAP1_Pos            (9)                                         /*!< ECAP_T::STATUS: CAP1 Position              */
#define ECAP_STATUS_CAP1_Msk            (0x1UL << ECAP_STATUS_CAP1_Pos)             /*!< ECAP_T::STATUS: CAP1 Mask                  */

#define ECAP_STATUS_CAP2_Pos            (10)                                        /*!< ECAP_T::STATUS: CAP2 Position              */
#define ECAP_STATUS_CAP2_Msk            (0x1UL << ECAP_STATUS_CAP2_Pos)             /*!< ECAP_T::STATUS: CAP2 Mask                  */

/** @} ECAP_CONST */
/** @} end of ECAP register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __ECAP_REG_H__ */
